Revit 2027 API
Curve.Period Property
The period of this curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Period { get; }
Public ReadOnly Property Period As Double
	Get
public:
property double Period {
	double get ();
}
member Period : float with get
Property Value
Double
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the curve is not cyclic.
See Also
Reference
Curve Class
Autodesk.Revit.DB Namespace